[
  {
    "contentId":"landing",
    "title":"Women’s Eyeglasses & Women’s Sunglasses Online",
    "description":"Designed by Stacey Bendet in New York City, alice + olivia eyewear offers a wide range of prescription eyeglasses and sunglasses crafted with modern, stylish and sexy finishes. From hand-dyed lenses to custom acetates, alice + olivia eyewear is an extension of the designs found in Stacey’s ready-to-wear clothing collections. Our online eyeglasses and sunglasses shop features prescription glasses, women’s sunglasses, and women’s designer reading glasses. Virtually try on the glasses before you purchase with 3-D digital mapping. Free shipping on all eyeglasses orders in the US. Need to try-on your pair of eyeglasses in a store? Browse the entire eyeglasses and sunglasses collection at one of our many retail locations."},
  {
    "contentId":"productListing",
    "title":"Prescription Eyeglasses for Men",
    "description":"Men’s glasses can be hard to find online, and that’s why we started Classic Specs. We wanted to make a company that crafted vintage style glasses for men in Brooklyn, New York and used the best quality materials and designs for superior frames – Classic Specs was born from that ideal. First, we start with high quality workmanship: Each pair of men’s glasses is made from premium acetate (which is also hypoallergenic), double barrel stainless steel hinges (very durable), and metal wire cores on each frame temple arm (reinforced temples). Then we add high-quality lenses: We have single vision prescription lenses for eyeglasses that can come in CR-39 or polycarbonate lightweight composite materials. We also have HD free-form progressive lenses for that need men’s progressive glasses (multi-focal glasses). Then we offer them to men looking for glasses online for $89 (single vision glasses) and $275 (progressive glasses). Curious about trying a pair of men’s glasses on before ordering from Classic Specs? No problem, we offer virtual try-on powered by Ditto and a home try-on program supported by the United States Postal Service. For the 3D virtual try-on powered by Ditto, you can use your webcam to map your face and instantly try on any pair of glasses from the comfort of your home. The home try-on is 100% free to use and is a great way to try on one or five pairs of frames for up to five days. After you’re done, just send the kit back and you’ll be ready to make your purchase on Classic Specs. Can’t wait to get started? Try some of our most popular glasses frames for men: The men’s Waverly glasses, the men’s Prescott glasses, or the men’s Logan glasses. Want to try a new style? Select the men’s Whitney glasses or the men’s Sullivan glasses."
  },
  {
    "contentId":"productDetails",
    "title":"Prescription Eyeglasses for Men",
    "description":"Men’s glasses can be hard to find online, and that’s why we started Classic Specs. We wanted to make a company that crafted vintage style glasses for men in Brooklyn, New York and used the best quality materials and designs for superior frames – Classic Specs was born from that ideal. First, we start with high quality workmanship: Each pair of men’s glasses is made from premium acetate (which is also hypoallergenic), double barrel stainless steel hinges (very durable), and metal wire cores on each frame temple arm (reinforced temples). Then we add high-quality lenses: We have single vision prescription lenses for eyeglasses that can come in CR-39 or polycarbonate lightweight composite materials. We also have HD free-form progressive lenses for that need men’s progressive glasses (multi-focal glasses). Then we offer them to men looking for glasses online for $89 (single vision glasses) and $275 (progressive glasses). Curious about trying a pair of men’s glasses on before ordering from Classic Specs? No problem, we offer virtual try-on powered by Ditto and a home try-on program supported by the United States Postal Service. For the 3D virtual try-on powered by Ditto, you can use your webcam to map your face and instantly try on any pair of glasses from the comfort of your home. The home try-on is 100% free to use and is a great way to try on one or five pairs of frames for up to five days. After you’re done, just send the kit back and you’ll be ready to make your purchase on Classic Specs. Can’t wait to get started? Try some of our most popular glasses frames for men: The men’s Waverly glasses, the men’s Prescott glasses, or the men’s Logan glasses. Want to try a new style? Select the men’s Whitney glasses or the men’s Sullivan glasses."
  },
  {
    "contentId":"location",
    "title":"alice + olivia eyewear Stores",
    "description":"Find an alice + olivia store location or stockist to shop the entire alice + olivia eyewear collection of women’s eyeglasses and women’s sunglasses in person.  alice + olivia stores in California, New York, Connecticut, DC, Florida, Georgia, Illinois, Massachusetts, and Texas feature the entire eyeglasses and sunglasses collection with staff that can assist with your questions and fitting in a new pair of alice + olivia eyewear frames.  Can’t find a store near you?  Shop online and order a pair with free shipping and free returns on all US orders."
  },
  {
    "contentId":"vto",
    "title":"Create a Ditto Virtual Try-On",
    "description":"Select “virtual try-on” on any eyeglasses or sunglasses product page to instantly experience alice + olivia glasses or sunglasses on your face from the comfort of your home."
  },
  {
    "contentId":"womens-eyeglasses",
    "title":"Women’s Eyeglasses Online",
    "description":"Welcome to the alice + olivia eyewear women’s eyeglasses collection. Designed by Stacey Bendet in New York City, alice + olivia eyewear  is a glamorous line of prescription eyeglasses and sunglasses crafted for the modern, stylish and sexy woman. From hand-dyed lenses to custom acetates, alice + olivia eyewear is an extension of the fresh and edgy designs found in Stacey’s ready-to-wear clothing collections. Shop for cat-eye glasses, round glasses, aviator style glasses and more.  All alice + olivia glasses can be made with prescription lenses, progressive lenses or reading lenses.  Each order features free shipping and returns in the US."
  },
  {
    "contentId":"womens-sunglasses",
    "title":"Women’s Sunglasses Online",
    "description":"Designed by Stacey Bendet in New York and made in Japan, alice + olivia sunglasses are glamorous and unique styles that you must own today.  Each pair of sunglasses is inspired by the alice + olivia world of Stacey and handmade in Japan with stunning detail and features. Find oversized round sunglasses, cat-eye sunglasses, wayfarer sunglasses, and more. All alice + olivia sunglasses can be made with prescription lenses, progressive lenses or reading lenses and feature UVA/UVB protective lenses.  Each order features free shipping and returns in the US."
  },
  {
    "contentId":"new-arrivals",
    "title":"Newest Women’s Sunglasses & Eyeglasses",
    "description":"Stacey Bendet is always creating new designs for alice + olivia eyewear with an eye towards making unique shapes, designs, and colors that speak to the fierce and sophisticated women of the alice + olivia world.  Inspired by her travel, friends, family, pop culture, and experiences the collection features a diverse mix of women’s glasses and sunglasses from season to season.  Be sure to check often for the latest in women’s eyeglasses and sunglasses before they’re sold out.  Each pair of alice + olivia eyewear frames is designed in New York and made in Japan.  Shipping is always free in the US."
  }
]
