[
  {
    "contentId":"landing",
    "title":"Alice and Olivia",
    "description":"Classics Specs designs prescription eyeglasses in Brooklyn, New York to sell in our stores in San Francisco, New Jersey, LA, and New York and online through the Classic Specs online eyeglasses experience. Each pair of eyeglasses and sunglasses is handcrafted with a vintage feel for men and women looking for the perfect pair of retro inspired sunglasses or glasses. We engineer each pair with precision to deliver a superior product directly to you online for under ninety dollars (with free shipping to anywhere in the US, even Alaska and Hawaii). Each frame features durable stainless steel hinges, hypoallergenic premium acetate, and CR39 or polycarbonate optical lenses. All eyeglasses and sunglasses are 99.9% UVA/UVB protective. Our workmanship is what sets us apart from other online eyeglasses companies. We stand-by our product and offer the world’s best eyeglasses support team to help with any issues you might experience. If you don’t 100% love your glasses or sunglasses you can return it to Classic Specs within 30 days for a full refund, no questions asked. We want your online eyeglasses experience to be easy, guaranteed. If you’re looking to experience our glasses and don’t know what to choose, select our “try glasses at home” or “try glasses online” programs. With our Home Try-On program, select up to five glasses frames that will be sent to you by United States Postal Service, free of charge. Choose the glasses you like, and send the kit back to make your purchase online at ClassicSpecs.com. For the, “try glasses online,” you can use our 3D virtual try-on, powered by Ditto to use your webcam to experience the glasses instantly (and from the comfort of your own home). We can’t wait for you to experience Classic Specs. Get started shopping men’s glasses and women’s glasses or learn more about the different glasses lenses types we offer."},
  {
    "contentId":"productListing",
    "title":"Prescription Eyeglasses for Men",
    "description":"Men’s glasses can be hard to find online, and that’s why we started Classic Specs. We wanted to make a company that crafted vintage style glasses for men in Brooklyn, New York and used the best quality materials and designs for superior frames – Classic Specs was born from that ideal. First, we start with high quality workmanship: Each pair of men’s glasses is made from premium acetate (which is also hypoallergenic), double barrel stainless steel hinges (very durable), and metal wire cores on each frame temple arm (reinforced temples). Then we add high-quality lenses: We have single vision prescription lenses for eyeglasses that can come in CR-39 or polycarbonate lightweight composite materials. We also have HD free-form progressive lenses for that need men’s progressive glasses (multi-focal glasses). Then we offer them to men looking for glasses online for $89 (single vision glasses) and $275 (progressive glasses). Curious about trying a pair of men’s glasses on before ordering from Classic Specs? No problem, we offer virtual try-on powered by Ditto and a home try-on program supported by the United States Postal Service. For the 3D virtual try-on powered by Ditto, you can use your webcam to map your face and instantly try on any pair of glasses from the comfort of your home. The home try-on is 100% free to use and is a great way to try on one or five pairs of frames for up to five days. After you’re done, just send the kit back and you’ll be ready to make your purchase on Classic Specs. Can’t wait to get started? Try some of our most popular glasses frames for men: The men’s Waverly glasses, the men’s Prescott glasses, or the men’s Logan glasses. Want to try a new style? Select the men’s Whitney glasses or the men’s Sullivan glasses."
  },
  {
    "contentId":"productDetails",
    "title":"Prescription Eyeglasses for Men",
    "description":"Men’s glasses can be hard to find online, and that’s why we started Classic Specs. We wanted to make a company that crafted vintage style glasses for men in Brooklyn, New York and used the best quality materials and designs for superior frames – Classic Specs was born from that ideal. First, we start with high quality workmanship: Each pair of men’s glasses is made from premium acetate (which is also hypoallergenic), double barrel stainless steel hinges (very durable), and metal wire cores on each frame temple arm (reinforced temples). Then we add high-quality lenses: We have single vision prescription lenses for eyeglasses that can come in CR-39 or polycarbonate lightweight composite materials. We also have HD free-form progressive lenses for that need men’s progressive glasses (multi-focal glasses). Then we offer them to men looking for glasses online for $89 (single vision glasses) and $275 (progressive glasses). Curious about trying a pair of men’s glasses on before ordering from Classic Specs? No problem, we offer virtual try-on powered by Ditto and a home try-on program supported by the United States Postal Service. For the 3D virtual try-on powered by Ditto, you can use your webcam to map your face and instantly try on any pair of glasses from the comfort of your home. The home try-on is 100% free to use and is a great way to try on one or five pairs of frames for up to five days. After you’re done, just send the kit back and you’ll be ready to make your purchase on Classic Specs. Can’t wait to get started? Try some of our most popular glasses frames for men: The men’s Waverly glasses, the men’s Prescott glasses, or the men’s Logan glasses. Want to try a new style? Select the men’s Whitney glasses or the men’s Sullivan glasses."
  }
]
